renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit-uart-esp32/ports/secure_sockets/iot_secure_sockets.c
/*
 * Amazon FreeRTOS Secure Socket V1.0.0
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file aws_secure_sockets.c
 * @brief WiFi and Secure Socket interface implementation.
 */

/* Define _SECURE_SOCKETS_WRAPPER_NOT_REDEFINE to prevent secure sockets functions
 * from redefining in iot_secure_sockets_wrapper_metrics.h */
#define _SECURE_SOCKETS_WRAPPER_NOT_REDEFINE

/* FreeRTOS includes. */
#include <string.h>
#include "FreeRTOS.h"
#include "FreeRTOSIPConfig.h"
#include "list.h"
#include "iot_secure_sockets.h"
#include "iot_tls.h"
#include "task.h"
#include "iot_pkcs11.h"
#include "iot_crypto.h"
#include "platform.h"
#include "r_wifi_esp32_if.h"

#undef _SECURE_SOCKETS_WRAPPER_NOT_REDEFINE


/* Internal context structure. */
typedef struct SSOCKETContext
{
    Socket_t xSocket;
    char * pcDestination;
    void * pvTLSContext;
    BaseType_t xRequireTLS;
    BaseType_t xSendFlags;
    BaseType_t xRecvFlags;
    uint32_t ulSendTimeout;
    uint32_t ulRecvTimeout;
    char * pcServerCertificate;
    uint32_t ulServerCertificateLength;
    uint32_t socket_no;
} SSOCKETContext_t, * SSOCKETContextPtr_t;

/**
 * @brief Maximum number of sockets.
 *
 * 16 total sockets
 */
#define MAX_NUM_SSOCKETS    (WIFI_CFG_CREATABLE_SOCKETS)

/**
 * @brief Number of secure sockets allocated.
 *
 * Keep a count of the number of open sockets.
 */
static uint8_t ssockets_num_allocated = 0;


static SemaphoreHandle_t xUcInUse = NULL;
static const TickType_t xMaxSemaphoreBlockTime = pdMS_TO_TICKS( 60000UL );

/*
 * @brief Network send callback.
 */
static BaseType_t prvNetworkSend( void * pvContext,
                                  const unsigned char * pucData,
                                  size_t xDataLength )
{
	BaseType_t send_byte;
    SSOCKETContextPtr_t pxContext = ( SSOCKETContextPtr_t ) pvContext; /*lint !e9087 cast used for portability. */

    send_byte = R_WIFI_ESP32_SocketSend(pxContext->socket_no, (uint8_t *)pucData, xDataLength, pxContext->ulSendTimeout);
    return send_byte;
}
/*-----------------------------------------------------------*/

/*
 * @brief Network receive callback.
*/
static BaseType_t prvNetworkRecv( void * pvContext,
                                 unsigned char * pucReceiveBuffer,
                                 size_t xReceiveLength )
{
	BaseType_t receive_byte;
   SSOCKETContextPtr_t pxContext = ( SSOCKETContextPtr_t ) pvContext; /*lint !e9087 cast used for portability. */


   receive_byte = R_WIFI_ESP32_SocketRecv(pxContext->socket_no, pucReceiveBuffer, xReceiveLength, pxContext->ulRecvTimeout);

   if(xReceiveLength == 64)
   {
   }
   return receive_byte;

//   return FreeRTOS_recv( pxContext->xSocket, pucReceiveBuffer, xReceiveLength, pxContext->xRecvFlags );
}

/*-----------------------------------------------------------*/

/**
 * @brief Creates a TCP socket.
 *
 * This call allocates memory and claims a socket resource.
 *
 * @sa SOCKETS_Close()
 *
 * @param[in] lDomain Must be set to SOCKETS_AF_INET. See @ref SocketDomains.
 * @param[in] lType Set to SOCKETS_SOCK_STREAM to create a TCP socket.
 * No other value is valid.  See @ref SocketTypes.
 * @param[in] lProtocol Set to SOCKETS_IPPROTO_TCP to create a TCP socket.
 * No other value is valid. See @ref Protocols.
 *
 * @return
 * * If a socket is created successfully, then the socket handle is
 * returned
 * * @ref SOCKETS_INVALID_SOCKET is returned if an error occurred.
 */
Socket_t SOCKETS_Socket( int32_t lDomain,
                         int32_t lType,
                         int32_t lProtocol )
{
	int32_t lStatus = SOCKETS_ERROR_NONE;
    int32_t ret;
    SSOCKETContextPtr_t pxContext = NULL;

    /* Ensure that only supported values are supplied. */
    configASSERT( lDomain == SOCKETS_AF_INET );
    configASSERT( lType == SOCKETS_SOCK_STREAM );
    configASSERT( lProtocol == SOCKETS_IPPROTO_TCP );

    if((lDomain != SOCKETS_AF_INET) || ( lType != SOCKETS_SOCK_STREAM ) || ( lProtocol != SOCKETS_IPPROTO_TCP ))
	{
		return SOCKETS_INVALID_SOCKET;
	}

    if (xSemaphoreTake( xUcInUse, xMaxSemaphoreBlockTime) == pdTRUE)
    {
		 if( SOCKETS_ERROR_NONE == lStatus )
		 {
			/* Allocate the internal context structure. */
			if( NULL == ( pxContext = pvPortMalloc( sizeof( SSOCKETContext_t ) ) ) )
			{
				configPRINTF(("create malloc error: %d\r\n",ret));
				lStatus = SOCKETS_ENOMEM;
			}
		}

		if( SOCKETS_ERROR_NONE == lStatus )
		{
			memset( pxContext, 0, sizeof( SSOCKETContext_t ) );
			/* Create the wrapped socket. */
			ret = R_WIFI_ESP32_SocketCreate(WIFI_SOCKET_IP_PROTOCOL_TCP, WIFI_SOCKET_IP_VERSION_4);

			if(0 > ret)
			{
				configPRINTF(("create error: %d\r\n",ret));
				lStatus = SOCKETS_SOCKET_ERROR;
			}
			else
			{
				pxContext->socket_no = ret;
				pxContext->xSocket = pxContext;
				pxContext->ulRecvTimeout = socketsconfigDEFAULT_RECV_TIMEOUT;
				pxContext->ulSendTimeout = socketsconfigDEFAULT_SEND_TIMEOUT;
			}
		}

		if( SOCKETS_ERROR_NONE != lStatus )
		{
			if(NULL != pxContext)
			{
				vPortFree( pxContext );
			}
			/* Give back the socketInUse mutex. */
		    lStatus = SOCKETS_INVALID_SOCKET;
		}
	    xSemaphoreGive(xUcInUse);
    }
    if( SOCKETS_ERROR_NONE != lStatus )
    {
        return SOCKETS_INVALID_SOCKET;
    }
    else
    {
    	return pxContext;
    }
}
/*-----------------------------------------------------------*/

Socket_t SOCKETS_Accept( Socket_t xSocket,
                         SocketsSockaddr_t * pxAddress,
                         Socklen_t * pxAddressLength )
{
    /* FIX ME. */
    return SOCKETS_INVALID_SOCKET;
}
/*-----------------------------------------------------------*/

/**
 * @brief Connects the socket to the specified IP address and port.
 *
 * The socket must first have been successfully created by a call to SOCKETS_Socket().
 *
 * @param[in] xSocket The handle of the socket to be connected.
 * @param[in] pxAddress A pointer to a SocketsSockaddr_t structure that contains the
 * the address to connect the socket to.
 * @param[in] xAddressLength Should be set to sizeof( @ref SocketsSockaddr_t ).
 *
 * @return
 * * @ref SOCKETS_ERROR_NONE if a connection is established.
 * * If an error occured, a negative value is returned. @ref SocketsErrors
 */
int32_t SOCKETS_Connect( Socket_t xSocket,
                         SocketsSockaddr_t * pxAddress,
                         Socklen_t xAddressLength )
{
    int32_t lStatus = SOCKETS_ERROR_NONE;
    wifi_err_t ret;
    SSOCKETContextPtr_t pxContext = ( SSOCKETContextPtr_t ) xSocket; /*lint !e9087 cast used for portability. */
    TLSParams_t xTLSParams = { 0 };

